In [1]:
from langchain.utilities import SQLDatabase
from langchain_experimental.sql import SQLDatabaseChain
from dotenv import load_dotenv
from langchain.llms import OpenAI
import os

#### OpenAI LLM & API key setup

In [2]:
 dotenv_path = "C:/Users/burha/OneDrive/Desktop/Career/api_key.env"
load_dotenv(dotenv_path)

True

In [3]:
api_key = os.getenv("api_key")
llm = OpenAI(openai_api_key=api_key, temperature=0.2)

#### Connect with database

In [4]:
db_user = "root"
db_password = "root"
db_host = "localhost"
db_name = "classicmodels"

db = SQLDatabase.from_uri(f"mysql+pymysql://{db_user}:{db_password}@{db_host}/{db_name}",sample_rows_in_table_info=3)

print(db.table_info)

CREATE TABLE customers (
	`customerNumber` INTEGER NOT NULL,
	`customerName` VARCHAR(50) NOT NULL,
	`contactLastName` VARCHAR(50) NOT NULL,
	`contactFirstName` VARCHAR(50) NOT NULL,
	phone VARCHAR(50) NOT NULL,
	`addressLine1` VARCHAR(50) NOT NULL,
	`addressLine2` VARCHAR(50),
	city VARCHAR(50) NOT NULL,
	state VARCHAR(50),
	`postalCode` VARCHAR(15),
	country VARCHAR(50) NOT NULL,
	`salesRepEmployeeNumber` INTEGER,
	`creditLimit` DECIMAL(10, 2),
	PRIMARY KEY (`customerNumber`),
	CONSTRAINT customers_ibfk_1 FOREIGN KEY(`salesRepEmployeeNumber`) REFERENCES employees (`employeeNumber`)
)COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4 ENGINE=InnoDB

/*
3 rows from customers table:
customerNumber	customerName	contactLastName	contactFirstName	phone	addressLine1	addressLine2	city	state	postalCode	country	salesRepEmployeeNumber	creditLimit
103	Atelier graphique	Schmitt	Carine 	40.32.2555	54, rue Royale	None	Nantes	None	44000	France	1370	21000.00
112	Signal Gift Stores	King	Jean	7025551838	8489 Strong St.	None	Las Vegas	NV	83030	USA	1166	71800.00
114	Australian Collectors, Co.	Ferguson	Peter	03 9520 4555	636 St Kilda Road	Level 3	Melbourne	Victoria	3004	Australia	1611	117300.00
*/


CREATE TABLE employees (
	`employeeNumber` INTEGER NOT NULL,
	`lastName` VARCHAR(50) NOT NULL,
	`firstName` VARCHAR(50) NOT NULL,
	extension VARCHAR(10) NOT NULL,
	email VARCHAR(100) NOT NULL,
	`officeCode` VARCHAR(10) NOT NULL,
	`reportsTo` INTEGER,
	`jobTitle` VARCHAR(50) NOT NULL,
	PRIMARY KEY (`employeeNumber`),
	CONSTRAINT employees_ibfk_1 FOREIGN KEY(`reportsTo`) REFERENCES employees (`employeeNumber`),
	CONSTRAINT employees_ibfk_2 FOREIGN KEY(`officeCode`) REFERENCES offices (`officeCode`)
)COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4 ENGINE=InnoDB

/*
3 rows from employees table:
employeeNumber	lastName	firstName	extension	email	officeCode	reportsTo	jobTitle
1002	Murphy	Diane	x5800	dmurphy@classicmodelcars.com	1	None	President
1056	Patterson	Mary	x4611	mpatterso@classicmodelcars.com	1	1002	VP Sales
1076	Firrelli	Jeff	x9273	jfirrelli@classicmodelcars.com	1	1002	VP Marketing
*/


CREATE TABLE offices (
	`officeCode` VARCHAR(10) NOT NULL,
	city VARCHAR(50) NOT NULL,
	phone VARCHAR(50) NOT NULL,
	`addressLine1` VARCHAR(50) NOT NULL,
	`addressLine2` VARCHAR(50),
	state VARCHAR(50),
	country VARCHAR(50) NOT NULL,
	`postalCode` VARCHAR(15) NOT NULL,
	territory VARCHAR(10) NOT NULL,
	PRIMARY KEY (`officeCode`)
)COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4 ENGINE=InnoDB

/*
3 rows from offices table:
officeCode	city	phone	addressLine1	addressLine2	state	country	postalCode	territory
1	San Francisco	+1 650 219 4782	100 Market Street	Suite 300	CA	USA	94080	NA
2	Boston	+1 215 837 0825	1550 Court Place	Suite 102	MA	USA	02107	NA
3	NYC	+1 212 555 3000	523 East 53rd Street	apt. 5A	NY	USA	10022	NA
*/


CREATE TABLE orderdetails (
	`orderNumber` INTEGER NOT NULL,
	`productCode` VARCHAR(15) NOT NULL,
	`quantityOrdered` INTEGER NOT NULL,
	`priceEach` DECIMAL(10, 2) NOT NULL,
	`orderLineNumber` SMALLINT NOT NULL,
	PRIMARY KEY (`orderNumber`, `productCode`),
	CONSTRAINT orderdetails_ibfk_1 FOREIGN KEY(`orderNumber`) REFERENCES orders (`orderNumber`),
	CONSTRAINT orderdetails_ibfk_2 FOREIGN KEY(`productCode`) REFERENCES products (`productCode`)
)COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4 ENGINE=InnoDB

/*
3 rows from orderdetails table:
orderNumber	productCode	quantityOrdered	priceEach	orderLineNumber
10100	S18_1749	30	136.00	3
10100	S18_2248	50	55.09	2
10100	S18_4409	22	75.46	4
*/


CREATE TABLE orders (
	`orderNumber` INTEGER NOT NULL,
	`orderDate` DATE NOT NULL,
	`requiredDate` DATE NOT NULL,
	`shippedDate` DATE,
	status VARCHAR(15) NOT NULL,
	comments TEXT,
	`customerNumber` INTEGER NOT NULL,
	PRIMARY KEY (`orderNumber`),
	CONSTRAINT orders_ibfk_1 FOREIGN KEY(`customerNumber`) REFERENCES customers (`customerNumber`)
)COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4 ENGINE=InnoDB

/*
3 rows from orders table:
orderNumber	orderDate	requiredDate	shippedDate	status	comments	customerNumber
10100	2003-01-06	2003-01-13	2003-01-10	Shipped	None	363
10101	2003-01-09	2003-01-18	2003-01-11	Shipped	Check on availability.	128
10102	2003-01-10	2003-01-18	2003-01-14	Shipped	None	181
*/


CREATE TABLE payments (
	`customerNumber` INTEGER NOT NULL,
	`checkNumber` VARCHAR(50) NOT NULL,
	`paymentDate` DATE NOT NULL,
	amount DECIMAL(10, 2) NOT NULL,
	PRIMARY KEY (`customerNumber`, `checkNumber`),
	CONSTRAINT payments_ibfk_1 FOREIGN KEY(`customerNumber`) REFERENCES customers (`customerNumber`)
)COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4 ENGINE=InnoDB

/*
3 rows from payments table:
customerNumber	checkNumber	paymentDate	amount
103	HQ336336	2004-10-19	6066.78
103	JM555205	2003-06-05	14571.44
103	OM314933	2004-12-18	1676.14
*/


CREATE TABLE productlines (
	`productLine` VARCHAR(50) NOT NULL,
	`textDescription` VARCHAR(4000),
	`htmlDescription` MEDIUMTEXT,
	image MEDIUMBLOB,
	PRIMARY KEY (`productLine`)
)COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4 ENGINE=InnoDB

/*
3 rows from productlines table:
productLine	textDescription	htmlDescription	image
Classic Cars	Attention car enthusiasts: Make your wildest car ownership dreams come true. Whether you are looking	None	None
Motorcycles	Our motorcycles are state of the art replicas of classic as well as contemporary motorcycle legends 	None	None
Planes	Unique, diecast airplane and helicopter replicas suitable for collections, as well as home, office o	None	None
*/


CREATE TABLE products (
	`productCode` VARCHAR(15) NOT NULL,
	`productName` VARCHAR(70) NOT NULL,
	`productLine` VARCHAR(50) NOT NULL,
	`productScale` VARCHAR(10) NOT NULL,
	`productVendor` VARCHAR(50) NOT NULL,
	`productDescription` TEXT NOT NULL,
	`quantityInStock` SMALLINT NOT NULL,
	`buyPrice` DECIMAL(10, 2) NOT NULL,
	`MSRP` DECIMAL(10, 2) NOT NULL,
	PRIMARY KEY (`productCode`),
	CONSTRAINT products_ibfk_1 FOREIGN KEY(`productLine`) REFERENCES productlines (`productLine`)
)COLLATE utf8mb4_0900_ai_ci DEFAULT CHARSET=utf8mb4 ENGINE=InnoDB

/*
3 rows from products table:
productCode	productName	productLine	productScale	productVendor	productDescription	quantityInStock	buyPrice	MSRP
S10_1678	1969 Harley Davidson Ultimate Chopper	Motorcycles	1:10	Min Lin Diecast	This replica features working kickstand, front suspension, gear-shift lever, footbrake lever, drive 	7933	48.81	95.70
S10_1949	1952 Alpine Renault 1300	Classic Cars	1:10	Classic Metal Creations	Turnable front wheels; steering function; detailed interior; detailed engine; opening hood; opening 	7305	98.58	214.30
S10_2016	1996 Moto Guzzi 1100i	Motorcycles	1:10	Highway 66 Mini Classics	Official Moto Guzzi logos and insignias, saddle bags located on side of motorcycle, detailed engine,	6625	68.99	118.94
*/

#### Few shot learning

In [7]:
few_shots = [
    {'Question' : "Who reports to William Patterson?",
     'SQLQuery' : "SELECT CONCAT(reports.firstname, ' ', reports.lastname) AS Employee FROM Employees boss JOIN Employees reports ON boss.employeeNumber = reports.reportsTo WHERE boss.firstName = 'William' and boss.lastName = 'Patterson';",
     'SQLResult': "Result of the SQL query",
     'Answer' : "'Andy Fixter', 'Peter Marsh', 'Tom King'"},
    {'Question': "Compute the commission for each sales representative, assuming the commission is 5% of the value of an order. Sort by employee last name and first name",
     'SQLQuery': "SELECT CONCAT(firstName, ' ',lastName) AS Name, FORMAT(.05 * SUM(quantityOrdered * priceEach),0) AS Commission FROM Employees JOIN Customers ON Employees.employeeNumber = Customers.salesRepEmployeeNumber JOIN Orders ON Customers.customerNumber = Orders.customerNumber JOIN OrderDetails ON Orders.orderNumber = OrderDetails.orderNumber GROUP BY employeeNumber ORDER BY lastName, firstName ASC;",
     'SQLResult': "Result of the SQL query",
     'Answer': "'Loui Bondur, 28,474', 'Larry Bott, 36,605', 'Pamela Castillo, 43,411', 'Julie Firrelli, 19,333','Andy Fixter, 28,129', 'Martin Gerard, 19,374'......"},
    {'Question': "What are the top 3 products by quantity of on hand for products listed on 'On Hold' orders?" ,
     'SQLQuery' : "SELECT productName, FORMAT(quantityInStock,0) AS `Quantity in stock` FROM OrderDetails JOIN Orders ON Orders.orderNumber = OrderDetails.orderNumber JOIN Products on OrderDetails.productCode = Products.productCode WHERE status = 'On Hold' order by quantityInStock desc limit 3;",
     'SQLResult': "Result of the SQL query",
     'Answer': "'America West Airlines B757-200, 9,653', '2002 Chevy Corvette, 9,446', '1912 Ford Model T Delivery Wagon, 9,173'"} ,
     {'Question' : "What is the value of orders shipped in August 2004?" ,
      'SQLQuery': "SELECT FORMAT(SUM(quantityOrdered*priceEach),0) as orderValue FROM Orders JOIN OrderDetails ON Orders.orderNumber = OrderDetails. orderNumber AND YEAR(orderDate) = 2004 AND MONTH(orderDate) = 8;",
      'SQLResult': "Result of the SQL query",
      'Answer' : '419,327'},
    {'Question' : "What is the average percentage markup of the MSRP on buyPrice rounded to the nearest deicmal?" ,
      'SQLQuery': "SELECT ROUND(AVG(MSRP/buyPrice)*100 - 100) from Products;",
      'SQLResult': "Result of the SQL query",
      'Answer' : '89'},
    {'Question' : "Who are the employees in Boston?" ,
      'SQLQuery': "SELECT firstName, lastName FROM Employees JOIN Offices ON Employees.officeCode = Offices.officeCode AND city = 'Boston';",
      'SQLResult': "Result of the SQL query",
      'Answer' : '"Julie Firrelli", "Steve Patterson"'},
    {'Question' : "List the names of the top 3 products (by inventory) sold at less than 80% of the MSRP." ,
      'SQLQuery': "SELECT DISTINCT(productName), priceEach, MSRP, FORMAT(quantityInStock,0) AS `Quantity in stock` FROM OrderDetails JOIN Products ON OrderDetails.productCode = Products.productCode AND priceEach < .8*MSRP;",
      'SQLResult': "Result of the SQL query",
      'Answer' : '1976 Ford Gran Torino	117.59	146.99	9127, 1965 Aston Martin DB5	99.55	124.44	9042 American Airlines: MD-11S	59.22	74.03	8820'},
    {'Question' : "What are the top 3 most profitable product lines" ,
      'SQLQuery': "SELECT productLine AS `Product line`, FORMAT(SUM(quantityOrdered*(priceEach -buyPrice)),0) AS Profit FROM Products JOIN OrderDetails ON Products.productCode = OrderDetails.productCode GROUP BY productLine ORDER BY SUM(quantityOrdered*(priceEach -buyPrice)) DESC LIMIT 3;",
      'SQLResult': "Result of the SQL query",
      'Answer' : 'Classic Cars, Vintage Cars, and Motorcycles'}
    

    
]

### Creating Semantic Similarity Based example selector

- create embedding on the few_shots
- Store the embeddings in Chroma DB
- Retrieve the the top most Semantically close example from the vector store

In [8]:
from langchain.prompts import SemanticSimilarityExampleSelector
from langchain.embeddings import HuggingFaceEmbeddings
from langchain.vectorstores import Chroma

In [9]:
embeddings = HuggingFaceEmbeddings(model_name='sentence-transformers/all-MiniLM-L6-v2')

to_vectorize = [" ".join(example.values()) for example in few_shots]

In [10]:
to_vectorize

["Who reports to William Patterson? SELECT CONCAT(reports.firstname, ' ', reports.lastname) AS Employee FROM Employees boss JOIN Employees reports ON boss.employeeNumber = reports.reportsTo WHERE boss.firstName = 'William' and boss.lastName = 'Patterson'; Result of the SQL query 'Andy Fixter', 'Peter Marsh', 'Tom King'",
 "Compute the commission for each sales representative, assuming the commission is 5% of the value of an order. Sort by employee last name and first name SELECT CONCAT(firstName, ' ',lastName) AS Name, FORMAT(.05 * SUM(quantityOrdered * priceEach),0) AS Commission FROM Employees JOIN Customers ON Employees.employeeNumber = Customers.salesRepEmployeeNumber JOIN Orders ON Customers.customerNumber = Orders.customerNumber JOIN OrderDetails ON Orders.orderNumber = OrderDetails.orderNumber GROUP BY employeeNumber ORDER BY lastName, firstName ASC; Result of the SQL query 'Loui Bondur, 28,474', 'Larry Bott, 36,605', 'Pamela Castillo, 43,411', 'Julie Firrelli, 19,333','Andy Fixter, 28,129', 'Martin Gerard, 19,374'......",
 "What are the top 3 products by quantity of on hand for products listed on 'On Hold' orders? SELECT productName, FORMAT(quantityInStock,0) AS `Quantity in stock` FROM OrderDetails JOIN Orders ON Orders.orderNumber = OrderDetails.orderNumber JOIN Products on OrderDetails.productCode = Products.productCode WHERE status = 'On Hold' order by quantityInStock desc limit 3; Result of the SQL query 'America West Airlines B757-200, 9,653', '2002 Chevy Corvette, 9,446', '1912 Ford Model T Delivery Wagon, 9,173'",
 'What is the value of orders shipped in August 2004? SELECT FORMAT(SUM(quantityOrdered*priceEach),0) as orderValue FROM Orders JOIN OrderDetails ON Orders.orderNumber = OrderDetails. orderNumber AND YEAR(orderDate) = 2004 AND MONTH(orderDate) = 8; Result of the SQL query 419,327',
 'What is the average percentage markup of the MSRP on buyPrice rounded to the nearest deicmal? SELECT ROUND(AVG(MSRP/buyPrice)*100 - 100) from Products; Result of the SQL query 89',
 'Who are the employees in Boston? SELECT firstName, lastName FROM Employees JOIN Offices ON Employees.officeCode = Offices.officeCode AND city = \'Boston\'; Result of the SQL query "Julie Firrelli", "Steve Patterson"',
 'List the names of the top 3 products (by inventory) sold at less than 80% of the MSRP. SELECT DISTINCT(productName), priceEach, MSRP, FORMAT(quantityInStock,0) AS `Quantity in stock` FROM OrderDetails JOIN Products ON OrderDetails.productCode = Products.productCode AND priceEach < .8*MSRP; Result of the SQL query 1976 Ford Gran Torino\t117.59\t146.99\t9127, 1965 Aston Martin DB5\t99.55\t124.44\t9042 American Airlines: MD-11S\t59.22\t74.03\t8820',
 'What are the top 3 most profitable product lines SELECT productLine AS `Product line`, FORMAT(SUM(quantityOrdered*(priceEach -buyPrice)),0) AS Profit FROM Products JOIN OrderDetails ON Products.productCode = OrderDetails.productCode GROUP BY productLine ORDER BY SUM(quantityOrdered*(priceEach -buyPrice)) DESC LIMIT 3; Result of the SQL query Classic Cars, Vintage Cars, and Motorcycles']

In [11]:
vectorstore = Chroma.from_texts(to_vectorize, embeddings, metadatas=few_shots)

In [12]:
example_selector = SemanticSimilarityExampleSelector(
    vectorstore=vectorstore,
    k=2,
)

example_selector.select_examples({"Question": "Who reports to Mary Patterson?"})

[{'Answer': "'Andy Fixter', 'Peter Marsh', 'Tom King'",
  'Question': 'Who reports to William Patterson?',
  'SQLQuery': "SELECT CONCAT(reports.firstname, ' ', reports.lastname) AS Employee FROM Employees boss JOIN Employees reports ON boss.employeeNumber = reports.reportsTo WHERE boss.firstName = 'William' and boss.lastName = 'Patterson';",
  'SQLResult': 'Result of the SQL query'},
 {'Answer': '"Julie Firrelli", "Steve Patterson"',
  'Question': 'Who are the employees in Boston?',
  'SQLQuery': "SELECT firstName, lastName FROM Employees JOIN Offices ON Employees.officeCode = Offices.officeCode AND city = 'Boston';",
  'SQLResult': 'Result of the SQL query'}]

In [13]:
example_selector.select_examples({"Question": "Report the number of orders 'On Hold' for each customer."})

[{'Answer': "'America West Airlines B757-200, 9,653', '2002 Chevy Corvette, 9,446', '1912 Ford Model T Delivery Wagon, 9,173'",
  'Question': "What are the top 3 products by quantity of on hand for products listed on 'On Hold' orders?",
  'SQLQuery': "SELECT productName, FORMAT(quantityInStock,0) AS `Quantity in stock` FROM OrderDetails JOIN Orders ON Orders.orderNumber = OrderDetails.orderNumber JOIN Products on OrderDetails.productCode = Products.productCode WHERE status = 'On Hold' order by quantityInStock desc limit 3;",
  'SQLResult': 'Result of the SQL query'},
 {'Answer': "'Loui Bondur, 28,474', 'Larry Bott, 36,605', 'Pamela Castillo, 43,411', 'Julie Firrelli, 19,333','Andy Fixter, 28,129', 'Martin Gerard, 19,374'......",
  'Question': 'Compute the commission for each sales representative, assuming the commission is 5% of the value of an order. Sort by employee last name and first name',
  'SQLQuery': "SELECT CONCAT(firstName, ' ',lastName) AS Name, FORMAT(.05 * SUM(quantityOrdered * priceEach),0) AS Commission FROM Employees JOIN Customers ON Employees.employeeNumber = Customers.salesRepEmployeeNumber JOIN Orders ON Customers.customerNumber = Orders.customerNumber JOIN OrderDetails ON Orders.orderNumber = OrderDetails.orderNumber GROUP BY employeeNumber ORDER BY lastName, firstName ASC;",
  'SQLResult': 'Result of the SQL query'}]

In [14]:
example_selector.select_examples({"Question": "List all the products purchased by Herkku Gifts"})

[{'Answer': "'America West Airlines B757-200, 9,653', '2002 Chevy Corvette, 9,446', '1912 Ford Model T Delivery Wagon, 9,173'",
  'Question': "What are the top 3 products by quantity of on hand for products listed on 'On Hold' orders?",
  'SQLQuery': "SELECT productName, FORMAT(quantityInStock,0) AS `Quantity in stock` FROM OrderDetails JOIN Orders ON Orders.orderNumber = OrderDetails.orderNumber JOIN Products on OrderDetails.productCode = Products.productCode WHERE status = 'On Hold' order by quantityInStock desc limit 3;",
  'SQLResult': 'Result of the SQL query'},
 {'Answer': 'Classic Cars, Vintage Cars, and Motorcycles',
  'Question': 'What are the top 3 most profitable product lines',
  'SQLQuery': 'SELECT productLine AS `Product line`, FORMAT(SUM(quantityOrdered*(priceEach -buyPrice)),0) AS Profit FROM Products JOIN OrderDetails ON Products.productCode = OrderDetails.productCode GROUP BY productLine ORDER BY SUM(quantityOrdered*(priceEach -buyPrice)) DESC LIMIT 3;',
  'SQLResult': 'Result of the SQL query'}]

In [15]:
### my sql based instruction prompt
mysql_prompt = """You are a MySQL expert. Given an input question, first create a syntactically correct MySQL query to run, then look at the results of the query and return the answer to the input question.
Unless the user specifies in the question a specific number of examples to obtain, query for at most {top_k} results using the LIMIT clause as per MySQL. You can order the results to return the most informative data in the database.
Never query for all columns from a table. You must query only the columns that are needed to answer the question. Wrap each column name in backticks (`) to denote them as delimited identifiers.
Pay attention to use only the column names you can see in the tables below. Be careful to not query for columns that do not exist. Also, pay attention to which column is in which table.
Pay attention to use CURDATE() function to get the current date, if the question involves "today".

Use the following format:

Question: Question here
SQLQuery: Query to run with no pre-amble
SQLResult: Result of the SQLQuery
Answer: Final answer here

No pre-amble.
"""

In [16]:
from langchain.prompts import FewShotPromptTemplate
from langchain.chains.sql_database.prompt import PROMPT_SUFFIX, _mysql_prompt

print(PROMPT_SUFFIX)

Only use the following tables:
{table_info}

Question: {input}

### Setting up PromptTemplete using input variables

In [17]:
from langchain.prompts.prompt import PromptTemplate

example_prompt = PromptTemplate(
    input_variables=["Question", "SQLQuery", "SQLResult","Answer",],
    template="\nQuestion: {Question}\nSQLQuery: {SQLQuery}\nSQLResult: {SQLResult}\nAnswer: {Answer}",
)

In [18]:
print(_mysql_prompt)

You are a MySQL expert. Given an input question, first create a syntactically correct MySQL query to run, then look at the results of the query and return the answer to the input question.
Unless the user specifies in the question a specific number of examples to obtain, query for at most {top_k} results using the LIMIT clause as per MySQL. You can order the results to return the most informative data in the database.
Never query for all columns from a table. You must query only the columns that are needed to answer the question. Wrap each column name in backticks (`) to denote them as delimited identifiers.
Pay attention to use only the column names you can see in the tables below. Be careful to not query for columns that do not exist. Also, pay attention to which column is in which table.
Pay attention to use CURDATE() function to get the current date, if the question involves "today".

Use the following format:

Question: Question here
SQLQuery: SQL Query to run
SQLResult: Result of the SQLQuery
Answer: Final answer here

In [19]:
few_shot_prompt = FewShotPromptTemplate(
    example_selector=example_selector,
    example_prompt=example_prompt,
    prefix=mysql_prompt,
    suffix=PROMPT_SUFFIX,
    input_variables=["input", "table_info", "top_k"], #These variables are used in the prefix and suffix
)

In [20]:
new_chain = SQLDatabaseChain.from_llm(llm, db, verbose=True, prompt=few_shot_prompt)

In [24]:
new_chain("Find the products sold in 2003 but not 2004.")

> Entering new SQLDatabaseChain chain...
Find the products sold in 2003 but not 2004.
SQLQuery:SELECT DISTINCT productName FROM Products JOIN OrderDetails ON Products.productCode = OrderDetails.productCode JOIN Orders ON OrderDetails.orderNumber = Orders.orderNumber WHERE YEAR(Orders.orderDate) = 2003 AND Products.productCode NOT IN (SELECT productCode FROM OrderDetails JOIN Orders ON OrderDetails.orderNumber = Orders.orderNumber WHERE YEAR(Orders.orderDate) = 2004);
SQLResult:
Answer:1952 Alpine Renault 1300, 1996 Moto Guzzi 1100i, 1993 Mazda RX-7, 1937 Lincoln Berline, 1936 Mercedes Benz 500k Roadster
> Finished chain.

{'query': 'Find the products sold in 2003 but not 2004.',
 'result': '1952 Alpine Renault 1300, 1996 Moto Guzzi 1100i, 1993 Mazda RX-7, 1937 Lincoln Berline, 1936 Mercedes Benz 500k Roadster'}

In [32]:
new_chain("What are the top 3 most profitable product lines and the profits calculated for each product line")

> Entering new SQLDatabaseChain chain...
What are the top 3 most profitable product lines and the profits calculated for each product line
SQLQuery:SELECT productLine AS `Product line`, FORMAT(SUM(quantityOrdered*(priceEach -buyPrice)),0) AS Profit FROM Products JOIN OrderDetails ON Products.productCode = OrderDetails.productCode GROUP BY productLine ORDER BY SUM(quantityOrdered*(priceEach -buyPrice)) DESC LIMIT 3;
SQLResult: [('Classic Cars', '1,526,212'), ('Vintage Cars', '737,268'), ('Motorcycles', '469,255')]
Answer:Classic Cars, Vintage Cars, and Motorcycles with profits of $1,526,212, $737,268, and $469,255 respectively.
> Finished chain.

{'query': 'What are the top 3 most profitable product lines and the profits calculated for each product line',
 'result': 'Classic Cars, Vintage Cars, and Motorcycles with profits of $1,526,212, $737,268, and $469,255 respectively.'}

In [41]:
new_chain("Display the difference in the amount received for each month of 2004 compared to 2003?")

> Entering new SQLDatabaseChain chain...
Display the difference in the amount received for each month of 2004 compared to 2003?
SQLQuery:SELECT FORMAT(SUM(amount),0) AS Difference FROM Payments WHERE YEAR(paymentDate) = 2004 GROUP BY MONTH(paymentDate) UNION SELECT FORMAT(SUM(amount),0) AS Difference FROM Payments WHERE YEAR(paymentDate) = 2003 GROUP BY MONTH(paymentDate);
SQLResult: [('185,103',), ('819,286',), ('378,094',), ('404,603',), ('857,187',), ('476,446',), ('234,152',), ('284,191',), ('208,524',), ('173,246',), ('106,652',), ('185,843',), ('180,219',), ('159,882',), ('144,384',), ('316,858',), ('136,314',), ('246,205',), ('694,293',), ('26,268',), ('826,638',), ('199,704',), ('158,247',), ('161,206',)]
Answer:The difference in the amount received for each month of 2004 compared to 2003 is: 185,103, 819,286, 378,094, 404,603, 857,187, 476,446, 234,152, 284,191, 208,524, 173,246, 106,652, 185,843, 180,219, 159,882, 144,384, 316,858, 136,314, 246,205, 694,293, 26,268, 826,638, 199,704, 158,247, 161,206.
> Finished chain.

{'query': 'Display the difference in the amount received for each month of 2004 compared to 2003?',
 'result': 'The difference in the amount received for each month of 2004 compared to 2003 is: 185,103, 819,286, 378,094, 404,603, 857,187, 476,446, 234,152, 284,191, 208,524, 173,246, 106,652, 185,843, 180,219, 159,882, 144,384, 316,858, 136,314, 246,205, 694,293, 26,268, 826,638, 199,704, 158,247, 161,206.'}

In [29]:
new_chain("What is the percentage value of each product in inventory sorted by the highest percentage. Display only the top 5")

> Entering new SQLDatabaseChain chain...
What is the percentage value of each product in inventory sorted by the highest percentage. Display only the top 5
SQLQuery:SELECT productName, FORMAT(quantityInStock/(SELECT SUM(quantityInStock) FROM Products)*100,2) AS `Percentage in stock` FROM Products ORDER BY `Percentage in stock` DESC LIMIT 5;
SQLResult: [('2002 Suzuki XREO', '1.80'), ('1995 Honda Civic', '1.76'), ('America West Airlines B757-200', '1.74'), ('2002 Chevy Corvette', '1.70'), ('1932 Model A Ford J-Coupe', '1.69')]
Answer:2002 Suzuki XREO, 1.80%; 1995 Honda Civic, 1.76%; America West Airlines B757-200, 1.74%; 2002 Chevy Corvette, 1.70%; 1932 Model A Ford J-Coupe, 1.69%
> Finished chain.

{'query': 'What is the percentage value of each product in inventory sorted by the highest percentage. Display only the top 5',
 'result': '2002 Suzuki XREO, 1.80%; 1995 Honda Civic, 1.76%; America West Airlines B757-200, 1.74%; 2002 Chevy Corvette, 1.70%; 1932 Model A Ford J-Coupe, 1.69%'}

In [42]:
new_chain.run("""WITH
t2003 AS (SELECT YEAR(paymentDate) AS 'year', MONTH(paymentDate) AS 'month', sum(amount) AS amount FROM Payments
WHERE YEAR(paymentDate) = 2003
GROUP BY YEAR(paymentDate), MONTH(paymentDate)),
t2004 AS (SELECT YEAR(paymentDate) AS 'year', MONTH(paymentDate) AS 'month', sum(amount) AS amount FROM Payments
WHERE YEAR(paymentDate) = 2004
GROUP BY YEAR(paymentDate), MONTH(paymentDate))
SELECT t2003.month,format((t2004.amount - t2003.amount),2) AS variance
FROM t2003 JOIN t2004
ON t2003.month = t2004.month
ORDER BY t2003.month;""")

> Entering new SQLDatabaseChain chain...
WITH
t2003 AS (SELECT YEAR(paymentDate) AS 'year', MONTH(paymentDate) AS 'month', sum(amount) AS amount FROM Payments
WHERE YEAR(paymentDate) = 2003
GROUP BY YEAR(paymentDate), MONTH(paymentDate)),
t2004 AS (SELECT YEAR(paymentDate) AS 'year', MONTH(paymentDate) AS 'month', sum(amount) AS amount FROM Payments
WHERE YEAR(paymentDate) = 2004
GROUP BY YEAR(paymentDate), MONTH(paymentDate))
SELECT t2003.month,format((t2004.amount - t2003.amount),2) AS variance
FROM t2003 JOIN t2004
ON t2003.month = t2004.month
ORDER BY t2003.month;
SQLQuery:SELECT t2003.month, FORMAT((t2004.amount - t2003.amount), 2) AS variance
FROM (SELECT YEAR(paymentDate) AS 'year', MONTH(paymentDate) AS 'month', SUM(amount) AS amount FROM Payments
WHERE YEAR(paymentDate) = 2003
GROUP BY YEAR(paymentDate), MONTH(paymentDate)) AS t2003
JOIN (SELECT YEAR(paymentDate) AS 'year', MONTH(paymentDate) AS 'month', SUM(amount) AS amount FROM Payments
WHERE YEAR(paymentDate) = 2004
GROUP BY YEAR(paymentDate), MONTH(paymentDate)) AS t2004
ON t2003.month = t2004.month
ORDER BY t2003.month;
SQLResult: [(1, '207,884.51'), (2, '-37,732.35'), (3, '204,898.73'), (4, '36,932.04'), (5, '48,642.45'), (6, '5,623.88'), (7, '125,944.48'), (8, '131,889.44'), (9, '315,239.30'), (10, '-131,754.53'), (11, '162,894.62'), (12, '-7,352.02')]
Answer:The variance in payments between 2003 and 2004 for each month, sorted by month.
> Finished chain.

'The variance in payments between 2003 and 2004 for each month, sorted by month.'